{"config": [{"config": {"init": "glorot_uniform", "input_dtype": "float32", "W_constraint": null, "output_dim": 1024, "batch_input_shape": [null, 9], "input_dim": 9, "bias": true, "trainable": true, "name": "dense_1", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "sigmoid"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "bias": true, "trainable": true, "name": "dense_2", "W_regularizer": null, "b_constraint": null, "output_dim": 1024, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "sigmoid"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "bias": true, "trainable": true, "name": "dense_3", "W_regularizer": null, "b_constraint": null, "output_dim": 1024, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "sigmoid"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "bias": true, "trainable": true, "name": "dense_4", "W_regularizer": null, "b_constraint": null, "output_dim": 1024, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "sigmoid"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "bias": true, "trainable": true, "name": "dense_5", "W_regularizer": null, "b_constraint": null, "output_dim": 1024, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "sigmoid"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "input_dim": null, "bias": true, "trainable": true, "name": "dense_6", "W_regularizer": null, "b_constraint": null, "output_dim": 1, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "sigmoid"}, "class_name": "Activation"}], "keras_version": "1.0.6", "class_name": "Sequential"}