{"config": [{"config": {"trainable": true, "input_dtype": "float32", "output_dim": 2048, "input_dim": 9, "name": "dense_7", "bias": true, "b_regularizer": null, "batch_input_shape": [null, 9], "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_7", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "output_dim": 2048, "input_dim": null, "name": "dense_8", "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_8", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "output_dim": 1024, "input_dim": null, "name": "dense_9", "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_9", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "output_dim": 1024, "input_dim": null, "name": "dense_10", "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_10", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "output_dim": 1024, "input_dim": null, "name": "dense_11", "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_11", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "output_dim": 2, "input_dim": null, "name": "dense_12", "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_12", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.0.6"}