{"config": [{"config": {"trainable": true, "name": "zeropadding2d_31", "input_dtype": "float32", "batch_input_shape": [1, 3, 100, 56], "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "nb_col": 5, "nb_filter": 8, "dim_ordering": "th", "bias": true, "name": "conv1_1", "b_constraint": null, "trainable": true, "nb_row": 5, "activation": "relu", "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "zeropadding2d_32", "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "nb_col": 5, "nb_filter": 8, "dim_ordering": "th", "bias": true, "name": "conv1_2", "b_constraint": null, "trainable": true, "nb_row": 5, "activation": "relu", "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "dim_ordering": "th", "border_mode": "valid", "trainable": true, "name": "maxpooling2d_11"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "zeropadding2d_33", "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "nb_col": 5, "nb_filter": 16, "dim_ordering": "th", "bias": true, "name": "conv2_1", "b_constraint": null, "trainable": true, "nb_row": 5, "activation": "relu", "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "zeropadding2d_34", "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "nb_col": 5, "nb_filter": 16, "dim_ordering": "th", "bias": true, "name": "conv2_2", "b_constraint": null, "trainable": true, "nb_row": 5, "activation": "relu", "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [5, 4], "pool_size": [5, 4], "dim_ordering": "th", "border_mode": "valid", "trainable": true, "name": "maxpooling2d_12"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "zeropadding2d_35", "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "nb_col": 5, "nb_filter": 32, "dim_ordering": "th", "bias": true, "name": "conv3_1", "b_constraint": null, "trainable": true, "nb_row": 5, "activation": "relu", "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "zeropadding2d_36", "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "nb_col": 5, "nb_filter": 32, "dim_ordering": "th", "bias": true, "name": "conv3_2", "b_constraint": null, "trainable": true, "nb_row": 5, "activation": "relu", "b_regularizer": null, "W_constraint": null, "subsample": [1, 1], "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"p": 0.25, "trainable": true, "name": "dropout_22"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_6"}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_48", "input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 512}, "class_name": "Dense"}, {"config": {"activation": "tanh", "trainable": true, "name": "activation_48"}, "class_name": "Activation"}, {"config": {"p": 0.25, "trainable": true, "name": "dropout_23"}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_49", "input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 512}, "class_name": "Dense"}, {"config": {"activation": "tanh", "trainable": true, "name": "activation_49"}, "class_name": "Activation"}, {"config": {"p": 0.25, "trainable": true, "name": "dropout_24"}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_50", "input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 512}, "class_name": "Dense"}, {"config": {"activation": "tanh", "trainable": true, "name": "activation_50"}, "class_name": "Activation"}, {"config": {"p": 0.25, "trainable": true, "name": "dropout_25"}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_51", "input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 512}, "class_name": "Dense"}, {"config": {"activation": "tanh", "trainable": true, "name": "activation_51"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_52", "input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 512}, "class_name": "Dense"}, {"config": {"activation": "tanh", "trainable": true, "name": "activation_52"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_53", "input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 512}, "class_name": "Dense"}, {"config": {"activation": "tanh", "trainable": true, "name": "activation_53"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_54", "input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 512}, "class_name": "Dense"}, {"config": {"activation": "tanh", "trainable": true, "name": "activation_54"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_55", "input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 512}, "class_name": "Dense"}, {"config": {"activation": "tanh", "trainable": true, "name": "activation_55"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "bias": true, "name": "dense_56", "input_dim": null, "b_constraint": null, "trainable": true, "activation": "linear", "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 8}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "trainable": true, "name": "activation_56"}, "class_name": "Activation"}], "keras_version": "1.0.6", "class_name": "Sequential"}