{"config": [{"config": {"batch_input_shape": [1, 3, 100, 56], "name": "zeropadding2d_1", "padding": [2, 2], "trainable": true, "input_dtype": "float32"}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "name": "conv1_1", "activation": "relu", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 5, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": null, "nb_filter": 8, "nb_row": 5, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_2", "padding": [2, 2], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "name": "conv1_2", "activation": "relu", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 5, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": null, "nb_filter": 8, "nb_row": 5, "bias": true}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "th", "strides": [2, 2], "name": "maxpooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_3", "padding": [2, 2], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "name": "conv2_1", "activation": "relu", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 5, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": null, "nb_filter": 16, "nb_row": 5, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_4", "padding": [2, 2], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "name": "conv2_2", "activation": "relu", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 5, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": null, "nb_filter": 16, "nb_row": 5, "bias": true}, "class_name": "Convolution2D"}, {"config": {"pool_size": [5, 4], "border_mode": "valid", "dim_ordering": "th", "strides": [5, 4], "name": "maxpooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_5", "padding": [2, 2], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "name": "conv3_1", "activation": "relu", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 5, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": null, "nb_filter": 32, "nb_row": 5, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_6", "padding": [2, 2], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"trainable": true, "b_regularizer": null, "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "name": "conv3_2", "activation": "relu", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 5, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": null, "nb_filter": 32, "nb_row": 5, "bias": true}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_1", "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 1024, "bias": true, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_2", "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 512, "bias": true, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_3", "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 512, "bias": true, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_4", "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 512, "bias": true, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_5", "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 512, "bias": true, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_6", "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 512, "bias": true, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_7", "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 512, "bias": true, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_7", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_8", "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 512, "bias": true, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_8", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "name": "dense_9", "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 4, "bias": true, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_9", "activation": "sigmoid", "trainable": true}, "class_name": "Activation"}], "keras_version": "1.0.6", "class_name": "Sequential"}