{"config": [{"class_name": "Merge", "config": {"output_shape": null, "layers": [{"class_name": "Sequential", "config": [{"config": {"name": "zeropadding2d_56", "batch_input_shape": [1, 3, 50, 50], "padding": [2, 2], "trainable": true, "input_dtype": "float32"}, "class_name": "ZeroPadding2D"}, {"config": {"b_regularizer": null, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "bias": true, "nb_col": 5, "subsample": [1, 1], "nb_filter": 8, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "W_constraint": null, "name": "conv1_1", "W_regularizer": null, "trainable": true, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_57", "padding": [2, 2], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"b_regularizer": null, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "bias": true, "nb_col": 5, "subsample": [1, 1], "nb_filter": 8, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "W_constraint": null, "name": "conv1_2", "W_regularizer": null, "trainable": true, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "th", "border_mode": "valid", "name": "maxpooling2d_19", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_58", "padding": [2, 2], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"b_regularizer": null, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "bias": true, "nb_col": 5, "subsample": [1, 1], "nb_filter": 16, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "W_constraint": null, "name": "conv2_1", "W_regularizer": null, "trainable": true, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_59", "padding": [2, 2], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"b_regularizer": null, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "bias": true, "nb_col": 5, "subsample": [1, 1], "nb_filter": 16, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "W_constraint": null, "name": "conv2_2", "W_regularizer": null, "trainable": true, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "th", "border_mode": "valid", "name": "maxpooling2d_20", "pool_size": [5, 5], "strides": [5, 5], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_60", "padding": [2, 2], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"b_regularizer": null, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "bias": true, "nb_col": 5, "subsample": [1, 1], "nb_filter": 40, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "W_constraint": null, "name": "conv3_1", "W_regularizer": null, "trainable": true, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_61", "padding": [2, 2], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"b_regularizer": null, "b_constraint": null, "dim_ordering": "th", "activity_regularizer": null, "bias": true, "nb_col": 5, "subsample": [1, 1], "nb_filter": 32, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "W_constraint": null, "name": "conv3_2", "W_regularizer": null, "trainable": true, "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_46", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_10", "trainable": true}, "class_name": "Flatten"}]}, {"class_name": "Sequential", "config": [{"config": {"b_regularizer": null, "name": "dense_100", "b_constraint": null, "output_dim": 512, "activity_regularizer": null, "batch_input_shape": [1, 1], "bias": true, "input_dtype": "float32", "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "input_dim": null, "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_100", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "name": "dense_101", "b_constraint": null, "output_dim": 512, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "input_dim": null, "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_101", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_47", "p": 0.25, "trainable": true}, "class_name": "Dropout"}]}], "mode": "concat", "concat_axis": -1, "name": "merge_10", "dot_axes": [-1, -1], "output_shape_type": "raw", "mode_type": "raw"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_102", "b_constraint": null, "output_dim": 512, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "input_dim": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_102", "activation": "tanh", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_48", "p": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_103", "b_constraint": null, "output_dim": 512, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "input_dim": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_103", "activation": "tanh", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_49", "p": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_104", "b_constraint": null, "output_dim": 512, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "input_dim": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_104", "activation": "tanh", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_50", "p": 0.25, "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_105", "b_constraint": null, "output_dim": 512, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "input_dim": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_105", "activation": "tanh", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_106", "b_constraint": null, "output_dim": 512, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "input_dim": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_106", "activation": "tanh", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_107", "b_constraint": null, "output_dim": 512, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "input_dim": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_107", "activation": "tanh", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_108", "b_constraint": null, "output_dim": 512, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "input_dim": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_108", "activation": "tanh", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_109", "b_constraint": null, "output_dim": 512, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "input_dim": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_109", "activation": "tanh", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "name": "dense_110", "b_constraint": null, "output_dim": 3, "activity_regularizer": null, "bias": true, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "input_dim": null, "trainable": true, "W_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_110", "activation": "sigmoid", "trainable": true}}], "keras_version": "1.0.6", "class_name": "Sequential"}