{"config": [{"config": {"input_dtype": "float32", "name": "zeropadding2d_7", "trainable": true, "padding": [2, 2], "batch_input_shape": [1, 3, 100, 56]}, "class_name": "ZeroPadding2D"}, {"config": {"init": "glorot_uniform", "nb_row": 5, "border_mode": "valid", "nb_col": 5, "name": "conv1_1", "trainable": true, "bias": true, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "activation": "relu", "nb_filter": 8}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_8", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"init": "glorot_uniform", "nb_row": 5, "border_mode": "valid", "nb_col": 5, "name": "conv1_2", "trainable": true, "bias": true, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "activation": "relu", "nb_filter": 8}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "th", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_3", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_9", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"init": "glorot_uniform", "nb_row": 5, "border_mode": "valid", "nb_col": 5, "name": "conv2_1", "trainable": true, "bias": true, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "activation": "relu", "nb_filter": 16}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_10", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"init": "glorot_uniform", "nb_row": 5, "border_mode": "valid", "nb_col": 5, "name": "conv2_2", "trainable": true, "bias": true, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "activation": "relu", "nb_filter": 16}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "th", "border_mode": "valid", "strides": [5, 4], "pool_size": [5, 4], "name": "maxpooling2d_4", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_11", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"init": "glorot_uniform", "nb_row": 5, "border_mode": "valid", "nb_col": 5, "name": "conv3_1", "trainable": true, "bias": true, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "activation": "relu", "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_12", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"init": "glorot_uniform", "nb_row": 5, "border_mode": "valid", "nb_col": 5, "name": "conv3_2", "trainable": true, "bias": true, "activity_regularizer": null, "dim_ordering": "th", "W_constraint": null, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "b_regularizer": null, "activation": "relu", "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "bias": true, "output_dim": 2048, "name": "dense_11", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_11", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "bias": true, "output_dim": 2048, "name": "dense_12", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_12", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "bias": true, "output_dim": 2048, "name": "dense_13", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_13", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "bias": true, "output_dim": 1024, "name": "dense_14", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_14", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "bias": true, "output_dim": 1024, "name": "dense_15", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_15", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "bias": true, "output_dim": 1024, "name": "dense_16", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_16", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "bias": true, "output_dim": 512, "name": "dense_17", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_17", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "bias": true, "output_dim": 512, "name": "dense_18", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_18", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "bias": true, "output_dim": 512, "name": "dense_19", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_19", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "bias": true, "output_dim": 8, "name": "dense_20", "trainable": true, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "input_dim": null, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_20", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.0.6"}