{"keras_version": "1.0.6", "class_name": "Sequential", "config": [{"class_name": "ZeroPadding2D", "config": {"padding": [2, 2], "input_dtype": "float32", "trainable": true, "batch_input_shape": [1, 3, 100, 56], "name": "zeropadding2d_7"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [1, 1], "nb_row": 5, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "conv1_1", "border_mode": "valid", "nb_col": 5, "nb_filter": 8, "activation": "relu", "b_constraint": null, "dim_ordering": "th", "bias": true, "W_regularizer": null}}, {"class_name": "ZeroPadding2D", "config": {"padding": [2, 2], "trainable": true, "name": "zeropadding2d_8"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [1, 1], "nb_row": 5, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "conv1_2", "border_mode": "valid", "nb_col": 5, "nb_filter": 8, "activation": "relu", "b_constraint": null, "dim_ordering": "th", "bias": true, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "strides": [2, 2], "trainable": true, "name": "maxpooling2d_3", "dim_ordering": "th", "pool_size": [2, 2]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [2, 2], "trainable": true, "name": "zeropadding2d_9"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [1, 1], "nb_row": 5, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "conv2_1", "border_mode": "valid", "nb_col": 5, "nb_filter": 16, "activation": "relu", "b_constraint": null, "dim_ordering": "th", "bias": true, "W_regularizer": null}}, {"class_name": "ZeroPadding2D", "config": {"padding": [2, 2], "trainable": true, "name": "zeropadding2d_10"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [1, 1], "nb_row": 5, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "conv2_2", "border_mode": "valid", "nb_col": 5, "nb_filter": 16, "activation": "relu", "b_constraint": null, "dim_ordering": "th", "bias": true, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "strides": [5, 4], "trainable": true, "name": "maxpooling2d_4", "dim_ordering": "th", "pool_size": [5, 4]}}, {"class_name": "ZeroPadding2D", "config": {"padding": [2, 2], "trainable": true, "name": "zeropadding2d_11"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [1, 1], "nb_row": 5, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "conv3_1", "border_mode": "valid", "nb_col": 5, "nb_filter": 32, "activation": "relu", "b_constraint": null, "dim_ordering": "th", "bias": true, "W_regularizer": null}}, {"class_name": "ZeroPadding2D", "config": {"padding": [2, 2], "trainable": true, "name": "zeropadding2d_12"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [1, 1], "nb_row": 5, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "conv3_2", "border_mode": "valid", "nb_col": 5, "nb_filter": 32, "activation": "relu", "b_constraint": null, "dim_ordering": "th", "bias": true, "W_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"output_dim": 1024, "trainable": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_10", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_10"}}, {"class_name": "Dense", "config": {"output_dim": 1024, "trainable": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_11", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_11"}}, {"class_name": "Dense", "config": {"output_dim": 1024, "trainable": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_12", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_12"}}, {"class_name": "Dense", "config": {"output_dim": 1024, "trainable": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_13", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_13"}}, {"class_name": "Dense", "config": {"output_dim": 1024, "trainable": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_14", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_14"}}, {"class_name": "Dense", "config": {"output_dim": 1024, "trainable": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_15", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_15"}}, {"class_name": "Dense", "config": {"output_dim": 512, "trainable": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_16", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_16"}}, {"class_name": "Dense", "config": {"output_dim": 512, "trainable": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_17", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_17"}}, {"class_name": "Dense", "config": {"output_dim": 8, "trainable": true, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "name": "dense_18", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "input_dim": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_18"}}]}