{"config": [{"config": {"name": "zeropadding2d_13", "trainable": true, "padding": [2, 2], "batch_input_shape": [1, 3, 100, 56], "input_dtype": "float32"}, "class_name": "ZeroPadding2D"}, {"config": {"W_constraint": null, "nb_filter": 8, "bias": true, "dim_ordering": "th", "trainable": true, "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "conv1_1", "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_row": 5, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_14", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"W_constraint": null, "nb_filter": 8, "bias": true, "dim_ordering": "th", "trainable": true, "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "conv1_2", "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_row": 5, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_5", "trainable": true, "pool_size": [2, 2], "dim_ordering": "th", "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_15", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"W_constraint": null, "nb_filter": 16, "bias": true, "dim_ordering": "th", "trainable": true, "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "conv2_1", "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_row": 5, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_16", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"W_constraint": null, "nb_filter": 16, "bias": true, "dim_ordering": "th", "trainable": true, "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "conv2_2", "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_row": 5, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_6", "trainable": true, "pool_size": [5, 4], "dim_ordering": "th", "border_mode": "valid", "strides": [5, 4]}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_17", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"W_constraint": null, "nb_filter": 32, "bias": true, "dim_ordering": "th", "trainable": true, "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "conv3_1", "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_row": 5, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_18", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"W_constraint": null, "nb_filter": 32, "bias": true, "dim_ordering": "th", "trainable": true, "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "conv3_2", "subsample": [1, 1], "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_row": 5, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_21", "output_dim": 2048, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_21", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_22", "output_dim": 1024, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_22", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_23", "output_dim": 1024, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_23", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_24", "output_dim": 1024, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_24", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_25", "output_dim": 1024, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_25", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_26", "output_dim": 1024, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_26", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_27", "output_dim": 1024, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_27", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_28", "output_dim": 1024, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_28", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_29", "output_dim": 1024, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_29", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_30", "output_dim": 8, "W_constraint": null, "b_constraint": null, "activity_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_30", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "keras_version": "1.0.6", "class_name": "Sequential"}