{"config": [{"config": {"batch_input_shape": [1, 3, 100, 56], "trainable": true, "input_dtype": "float32", "name": "zeropadding2d_31", "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"border_mode": "valid", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "th", "trainable": true, "init": "glorot_uniform", "bias": true, "nb_col": 5, "name": "conv1_1", "W_constraint": null, "activation": "relu", "subsample": [1, 1], "nb_row": 5, "activity_regularizer": null, "nb_filter": 8}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "zeropadding2d_32", "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"border_mode": "valid", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "th", "trainable": true, "init": "glorot_uniform", "bias": true, "nb_col": 5, "name": "conv1_2", "W_constraint": null, "activation": "relu", "subsample": [1, 1], "nb_row": 5, "activity_regularizer": null, "nb_filter": 8}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "trainable": true, "name": "maxpooling2d_11"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "zeropadding2d_33", "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"border_mode": "valid", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "th", "trainable": true, "init": "glorot_uniform", "bias": true, "nb_col": 5, "name": "conv2_1", "W_constraint": null, "activation": "relu", "subsample": [1, 1], "nb_row": 5, "activity_regularizer": null, "nb_filter": 16}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "zeropadding2d_34", "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"border_mode": "valid", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "th", "trainable": true, "init": "glorot_uniform", "bias": true, "nb_col": 5, "name": "conv2_2", "W_constraint": null, "activation": "relu", "subsample": [1, 1], "nb_row": 5, "activity_regularizer": null, "nb_filter": 16}, "class_name": "Convolution2D"}, {"config": {"pool_size": [5, 4], "border_mode": "valid", "strides": [5, 4], "dim_ordering": "th", "trainable": true, "name": "maxpooling2d_12"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "zeropadding2d_35", "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"border_mode": "valid", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "th", "trainable": true, "init": "glorot_uniform", "bias": true, "nb_col": 5, "name": "conv3_1", "W_constraint": null, "activation": "relu", "subsample": [1, 1], "nb_row": 5, "activity_regularizer": null, "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "zeropadding2d_36", "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"border_mode": "valid", "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "dim_ordering": "th", "trainable": true, "init": "glorot_uniform", "bias": true, "nb_col": 5, "name": "conv3_2", "W_constraint": null, "activation": "relu", "subsample": [1, 1], "nb_row": 5, "activity_regularizer": null, "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_6", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "name": "dense_46", "bias": true, "activation": "linear", "output_dim": 1024, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_46", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "name": "dense_47", "bias": true, "activation": "linear", "output_dim": 1024, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_47", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "name": "dense_48", "bias": true, "activation": "linear", "output_dim": 1024, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_48", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "name": "dense_49", "bias": true, "activation": "linear", "output_dim": 1024, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_49", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "name": "dense_50", "bias": true, "activation": "linear", "output_dim": 512, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_50", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "name": "dense_51", "bias": true, "activation": "linear", "output_dim": 512, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_51", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "name": "dense_52", "bias": true, "activation": "linear", "output_dim": 512, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_52", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "name": "dense_53", "bias": true, "activation": "linear", "output_dim": 512, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_53", "activation": "tanh", "trainable": true}, "class_name": "Activation"}, {"config": {"b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "name": "dense_54", "bias": true, "activation": "linear", "output_dim": 4, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "activation_54", "activation": "tanh", "trainable": true}, "class_name": "Activation"}], "keras_version": "1.0.6", "class_name": "Sequential"}