{"config": [{"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_13", "batch_input_shape": [1, 3, 100, 56], "input_dtype": "float32", "padding": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "trainable": true, "bias": true, "nb_col": 5, "W_constraint": null, "nb_row": 5, "subsample": [1, 1], "name": "conv1_1", "border_mode": "valid", "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 10, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "dim_ordering": "th"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_14", "padding": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "trainable": true, "bias": true, "nb_col": 5, "W_constraint": null, "nb_row": 5, "subsample": [1, 1], "name": "conv1_2", "border_mode": "valid", "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 10, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "dim_ordering": "th"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_5", "dim_ordering": "th"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_15", "padding": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "trainable": true, "bias": true, "nb_col": 5, "W_constraint": null, "nb_row": 5, "subsample": [1, 1], "name": "conv2_1", "border_mode": "valid", "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 20, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "dim_ordering": "th"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_16", "padding": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "trainable": true, "bias": true, "nb_col": 5, "W_constraint": null, "nb_row": 5, "subsample": [1, 1], "name": "conv2_2", "border_mode": "valid", "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 20, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "dim_ordering": "th"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "pool_size": [5, 4], "strides": [5, 4], "name": "maxpooling2d_6", "dim_ordering": "th"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_17", "padding": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "trainable": true, "bias": true, "nb_col": 5, "W_constraint": null, "nb_row": 5, "subsample": [1, 1], "name": "conv3_1", "border_mode": "valid", "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 40, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "dim_ordering": "th"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_18", "padding": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "trainable": true, "bias": true, "nb_col": 5, "W_constraint": null, "nb_row": 5, "subsample": [1, 1], "name": "conv3_2", "border_mode": "valid", "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 40, "b_constraint": null, "activation": "relu", "activity_regularizer": null, "dim_ordering": "th"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "bias": true, "output_dim": 2048, "input_dim": null, "name": "dense_23", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_23"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "bias": true, "output_dim": 2048, "input_dim": null, "name": "dense_24", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_24"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "bias": true, "output_dim": 2048, "input_dim": null, "name": "dense_25", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_25"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "bias": true, "output_dim": 1024, "input_dim": null, "name": "dense_26", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_26"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "bias": true, "output_dim": 1024, "input_dim": null, "name": "dense_27", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_27"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "bias": true, "output_dim": 1024, "input_dim": null, "name": "dense_28", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_28"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "bias": true, "output_dim": 1024, "input_dim": null, "name": "dense_29", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_29"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "bias": true, "output_dim": 1024, "input_dim": null, "name": "dense_30", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_30"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "bias": true, "output_dim": 1024, "input_dim": null, "name": "dense_31", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_31"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "bias": true, "output_dim": 512, "input_dim": null, "name": "dense_32", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_32"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "trainable": true, "bias": true, "output_dim": 8, "input_dim": null, "name": "dense_33", "init": "glorot_uniform", "W_regularizer": null, "W_constraint": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_33"}}], "class_name": "Sequential", "keras_version": "1.0.6"}