{"class_name": "Sequential", "config": [{"class_name": "ZeroPadding2D", "config": {"trainable": true, "input_dtype": "float32", "name": "zeropadding2d_13", "padding": [2, 2], "batch_input_shape": [1, 3, 100, 56]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "name": "conv1_1", "subsample": [1, 1], "nb_col": 5, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "bias": true, "nb_row": 5, "b_constraint": null, "nb_filter": 8, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_14", "padding": [2, 2]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "name": "conv1_2", "subsample": [1, 1], "nb_col": 5, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "bias": true, "nb_row": 5, "b_constraint": null, "nb_filter": 8, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "th", "strides": [2, 2], "name": "maxpooling2d_5"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_15", "padding": [2, 2]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "name": "conv2_1", "subsample": [1, 1], "nb_col": 5, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "bias": true, "nb_row": 5, "b_constraint": null, "nb_filter": 16, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_16", "padding": [2, 2]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "name": "conv2_2", "subsample": [1, 1], "nb_col": 5, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "bias": true, "nb_row": 5, "b_constraint": null, "nb_filter": 16, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [5, 4], "border_mode": "valid", "dim_ordering": "th", "strides": [5, 4], "name": "maxpooling2d_6"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_17", "padding": [2, 2]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "name": "conv3_1", "subsample": [1, 1], "nb_col": 5, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "bias": true, "nb_row": 5, "b_constraint": null, "nb_filter": 32, "activation": "relu"}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zeropadding2d_18", "padding": [2, 2]}}, {"class_name": "Convolution2D", "config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "name": "conv3_2", "subsample": [1, 1], "nb_col": 5, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "border_mode": "valid", "bias": true, "nb_row": 5, "b_constraint": null, "nb_filter": 32, "activation": "relu"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_21", "input_dim": null, "activation": "linear", "output_dim": 2048, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_21", "activation": "tanh"}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_22", "input_dim": null, "activation": "linear", "output_dim": 1024, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_22", "activation": "tanh"}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_23", "input_dim": null, "activation": "linear", "output_dim": 1024, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_23", "activation": "tanh"}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_24", "input_dim": null, "activation": "linear", "output_dim": 1024, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_24", "activation": "tanh"}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_25", "input_dim": null, "activation": "linear", "output_dim": 1024, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_25", "activation": "tanh"}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_26", "input_dim": null, "activation": "linear", "output_dim": 1024, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_26", "activation": "tanh"}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_27", "input_dim": null, "activation": "linear", "output_dim": 1024, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_27", "activation": "tanh"}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_28", "input_dim": null, "activation": "linear", "output_dim": 1024, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_28", "activation": "tanh"}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_29", "input_dim": null, "activation": "linear", "output_dim": 1024, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_29", "activation": "tanh"}}, {"class_name": "Dense", "config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "b_regularizer": null, "name": "dense_30", "input_dim": null, "activation": "linear", "output_dim": 8, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_30", "activation": "sigmoid"}}], "keras_version": "1.0.6"}