{"config": [{"config": {"name": "zeropadding2d_7", "trainable": true, "input_dtype": "float32", "batch_input_shape": [1, 3, 100, 56], "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"b_constraint": null, "bias": true, "W_regularizer": null, "name": "conv1_1", "trainable": true, "border_mode": "valid", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "nb_col": 5, "dim_ordering": "th", "nb_row": 5, "nb_filter": 8, "b_regularizer": null, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_8", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"b_constraint": null, "bias": true, "W_regularizer": null, "name": "conv1_2", "trainable": true, "border_mode": "valid", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "nb_col": 5, "dim_ordering": "th", "nb_row": 5, "nb_filter": 8, "b_regularizer": null, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "th", "strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_3", "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_9", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"b_constraint": null, "bias": true, "W_regularizer": null, "name": "conv2_1", "trainable": true, "border_mode": "valid", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "nb_col": 5, "dim_ordering": "th", "nb_row": 5, "nb_filter": 16, "b_regularizer": null, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_10", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"b_constraint": null, "bias": true, "W_regularizer": null, "name": "conv2_2", "trainable": true, "border_mode": "valid", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "nb_col": 5, "dim_ordering": "th", "nb_row": 5, "nb_filter": 16, "b_regularizer": null, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "th", "strides": [5, 4], "pool_size": [5, 4], "name": "maxpooling2d_4", "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_11", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"b_constraint": null, "bias": true, "W_regularizer": null, "name": "conv3_1", "trainable": true, "border_mode": "valid", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "nb_col": 5, "dim_ordering": "th", "nb_row": 5, "nb_filter": 32, "b_regularizer": null, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_12", "trainable": true, "padding": [2, 2]}, "class_name": "ZeroPadding2D"}, {"config": {"b_constraint": null, "bias": true, "W_regularizer": null, "name": "conv3_2", "trainable": true, "border_mode": "valid", "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "nb_col": 5, "dim_ordering": "th", "nb_row": 5, "nb_filter": 32, "b_regularizer": null, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_9", "trainable": true, "activation": "linear", "W_constraint": null, "bias": true, "input_dim": null, "activity_regularizer": null, "output_dim": 2048, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_9", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_10", "trainable": true, "activation": "linear", "W_constraint": null, "bias": true, "input_dim": null, "activity_regularizer": null, "output_dim": 2048, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_10", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_11", "trainable": true, "activation": "linear", "W_constraint": null, "bias": true, "input_dim": null, "activity_regularizer": null, "output_dim": 2048, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_11", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_12", "trainable": true, "activation": "linear", "W_constraint": null, "bias": true, "input_dim": null, "activity_regularizer": null, "output_dim": 1024, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_12", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_13", "trainable": true, "activation": "linear", "W_constraint": null, "bias": true, "input_dim": null, "activity_regularizer": null, "output_dim": 1024, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_13", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_14", "trainable": true, "activation": "linear", "W_constraint": null, "bias": true, "input_dim": null, "activity_regularizer": null, "output_dim": 1024, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_14", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_15", "trainable": true, "activation": "linear", "W_constraint": null, "bias": true, "input_dim": null, "activity_regularizer": null, "output_dim": 512, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_15", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_16", "trainable": true, "activation": "linear", "W_constraint": null, "bias": true, "input_dim": null, "activity_regularizer": null, "output_dim": 512, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_16", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_17", "trainable": true, "activation": "linear", "W_constraint": null, "bias": true, "input_dim": null, "activity_regularizer": null, "output_dim": 512, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_17", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_18", "trainable": true, "activation": "linear", "W_constraint": null, "bias": true, "input_dim": null, "activity_regularizer": null, "output_dim": 4, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_18", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.0.6"}